Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
//// DEVICES

#define LIGHTS_COUNT (6)                             // Кол-во прожекторов
#define DEVICE_COUNT (LIGHTS_COUNT) + 3 + 3 + 1 + 1  // Кол-во всех устройств (нужно для Alarm'ов)
//// Дозаторы
#define DOSERS_COUNT (3)  // Кол-во дозаторов

std::unique_ptr<GBasic> doserK{};
std::unique_ptr<GBasic> doserNP{};
std::unique_ptr<GBasic> doserFe{};

//----------------Медиаторы----------------
//Компрессор
Mediator<Sensor> medCompressor;
//Помпа течения
Mediator<Sensor> medFlow;
//Помпа подъемная
Mediator<Sensor> medPump;
//Прожекторы
Mediator<Sensor> medLight;
// CO2
Mediator<Sensor> medCO2;
//Нагреватель
Mediator<Sensor> medHeater;
//-----------------------------------------
//Устройства
Sensor* compressor;
Sensor* flow;
Sensor* pump;
Sensor* co2;
Sensor* heater;

std::array<Doser, DOSERS_COUNT> dosers{Doser("Fe", Doser::Fe), Doser("K", Doser::K), Doser("NP", Doser::NP)};

std::array<Sensor, LIGHTS_COUNT> lights{Sensor(medLight, "", Sensor::light), Sensor(medLight, "", Sensor::light),
                                        Sensor(medLight, "", Sensor::light), Sensor(medLight, "", Sensor::light),
                                        Sensor(medLight, "", Sensor::light), Sensor(medLight, "", Sensor::light)};
//// Расписания всех устройств
std::array<Scheduler, DEVICE_COUNT> schedules;
//-----------------------------------------
#ifdef ARDUINO_ARCH_ESP32
namespace std_esp32 {
template <class T>
struct _Unique_if {
    typedef std::unique_ptr<T> _Single_object;
};

template <class T>
struct _Unique_if<T[]> {
    typedef std::unique_ptr<T[]> _Unknown_bound;
};

template <class T, size_t N>
struct _Unique_if<T[N]> {
    typedef void _Known_bound;
};

template <class T, class... Args>
typename _Unique_if<T>::_Single_object make_unique(Args&&... args) {
    return std::unique_ptr<T>(new T(std::forward<Args>(args)...));
}

template <class T>
typename _Unique_if<T>::_Unknown_bound make_unique(size_t n) {
    typedef typename std::remove_extent<T>::type U;
    return std::unique_ptr<T>(new U[n]());
}

template <class T, class... Args>
typename _Unique_if<T>::_Known_bound make_unique(Args&&...) = delete;
}  // namespace std_esp32
#endif
//// METHODS

void getTime() {
    char* strDateTime = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    Serial.printf_P(PSTR("Время %s\n"), String(strDateTime).c_str());
    free(strDateTime);
}

[[maybe_unused]] void printSheduler() {
    auto startDayUTC = 1604966400;
    Serial.printf_P(PSTR("%s\n"), "Информация о расписаниях:");
    for (auto item : schedules) {
        Serial.printf_P(PSTR("%s %s\n"), "Устройство:", item.getDevice()->getName().c_str());
        auto alarmTimeOn = Alarm.read(item.getOn()) + startDayUTC;
        auto tmOn = localtime(&alarmTimeOn);
        char bufferOn[32];
        strftime(bufferOn, 32, "%H:%M:%S", tmOn);
        Serial.printf_P(PSTR("%s %s\n"), "Включение", bufferOn);

        auto alarmTimeOff = Alarm.read(item.getOff()) + startDayUTC;
        auto tmOff = localtime(&alarmTimeOff);
        char bufferOff[32];
        strftime(bufferOff, 32, "%H:%M:%S", tmOff);
        Serial.printf_P(PSTR("%s %s\n\n"), "Выключение", bufferOff);
    }
}

void delPtr(const char* p) {
    delete[] p;
}

char* newPtr(size_t len) {
    char* p = new char[len];
    memset(p, 0, len);
    return p;
}

char* getPGMString(PGM_P pgm) {
    size_t len = strlen_P(pgm) + 1;
    char* buf = newPtr(len);
    strcpy_P(buf, pgm);
    buf[len - 1] = 0;
    return buf;
}

void callBack(Sensor sensor) {
    Serial.printf_P(PSTR("   %s %s\n"), "Callback", sensor.getName().c_str());
    char* url = nullptr;
    char* ct = nullptr;
    char* aj = nullptr;
    String urlString;
    String payload;

    switch (sensor.getSensorType()) {
        case Sensor::compressor:
            url = getPGMString(urlPutCompressor);
            break;
        case Sensor::flow:
            url = getPGMString(urlPutFlow);
            break;
        case Sensor::pump:
            url = getPGMString(urlPutPump);
            break;
        case Sensor::co2:
            url = getPGMString(urlPutCO2);
            break;
        case Sensor::heater:
            url = getPGMString(urlPutHeater);
            break;
        case Sensor::light:
            url = getPGMString(urlPutLight);
            break;
    }

    if (sensor.isLight()) {
        urlString = String(url) + String(sensor.getObjectID().c_str());
    } else {
        urlString = String(url);
    }

    delPtr(url);
    ct = getPGMString(contentType);
    aj = getPGMString(applicationJson);
    payload = String(sensor.serialize().c_str());
    if (https.begin(*client, urlString)) {
        https.addHeader(String(ct), String(aj));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.printf_P(PSTR("   %s состояние %s\n"), sensor.getName().c_str(), (sensor.getState() ? "ON" : "OFF"));
        } else {
            Serial.printf_P(PSTR("   %s: %s\n"), "Ошибка", HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("   %s\n"), "Невозможно подключиться\n");
    }
    delPtr(ct);
    delPtr(aj);
}

void initMediators() {
    medCompressor.Register("1", callBack);
    medFlow.Register("1", callBack);
    medPump.Register("1", callBack);
    medLight.Register("1", callBack);
    medCO2.Register("1", callBack);
    medHeater.Register("1", callBack);
}

void createDevicesAndScheduler() {
    compressor = new Sensor(medCompressor, "Компрессор", Sensor::compressor);
    flow = new Sensor(medFlow, "Помпа течения", Sensor::flow);
    pump = new Sensor(medPump, "Помпа подъёмная", Sensor::pump);
    co2 = new Sensor(medCO2, "CO2", Sensor::co2);
    heater = new Sensor(medHeater, "Нагреватель", Sensor::heater);

    for (int i = 0; i < LIGHTS_COUNT; ++i) {
        std::string buffer = "Прожектор " + std::to_string(i + 1);
        auto item = lights.at(i);
        item.setName(buffer);
        item.setMediator(medLight);
        lights.at(i) = item;
        auto schedule = schedules.at(i);
        schedule.setDevice(&(lights.at(i)));
        schedules.at(i) = schedule;
    }

    // Compressor
    auto schedule = schedules.at(6);
    schedule.setDevice(compressor);
    schedules.at(6) = schedule;

    // Flow
    schedule = schedules.at(7);
    schedule.setDevice(flow);
    schedules.at(7) = schedule;

