Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
    // CO2
    schedule = schedules.at(8);
    schedule.setDevice(co2);
    schedules.at(8) = schedule;

    // Dosers
    for (int i = 0; i < DOSERS_COUNT; ++i) {
        auto schedule_ = schedules.at(i + 9);
        schedule_.setDevice(&(dosers.at(i)));
        schedules.at(i + 9) = schedule_;
    }

    // Heater
    schedule = schedules.at(12);
    schedule.setDevice(heater);
    schedules.at(12) = schedule;

    // Pump
    schedule = schedules.at(13);
    schedule.setDevice(pump);
    schedules.at(13) = schedule;
}

void printDevice(Sensor* device) {
    if (device->isDoser()) {
        auto doser = static_cast<Doser*>(device);
        Serial.printf_P(PSTR("%s\n"), doser->DoserInfo().c_str());
    } else {
        Serial.printf_P(PSTR("%s\n"), device->sensorInfo().c_str());
    }
}

void printAllDevices() {
    Serial.printf_P(PSTR("\n%s\n"), "Вывод информации об устройствах:");
    for (auto light : lights) {
        printDevice(&light);
    }
    printDevice(compressor);
    printDevice(flow);
    printDevice(co2);

    for (auto doser : dosers) {
        printDevice(&doser);
    }

    printDevice(heater);
    printDevice(pump);
}

float getSensorTemperature(const uint8_t* sensorAddress) {
    unsigned int rawData;
    onewire.reset();
    onewire.select(sensorAddress);
    onewire.write(0x44, 1);
    onewire.reset();
    onewire.select(sensorAddress);
    onewire.write(0xBE);
    for (uint8_t i = 0; i < 9; i++) {
        sensorData[i] = onewire.read();
    }
    rawData = (sensorData[1] << 8) | sensorData[0];
    float celsius = static_cast<float>(rawData) / static_cast<float>(16.0);
    return celsius;
}

void getSensorsTemperature() {
    sensorTemperatureValue1 = getSensorTemperature(sensorTemperatureAddress1);
    sensorTemperatureValue2 = getSensorTemperature(sensorTemperatureAddress2);
    Serial.printf_P(PSTR(" [T1: %s°]  [T2: %s°]\n"), String(sensorTemperatureValue1).c_str(),
                    String(sensorTemperatureValue2).c_str());
}

void sendMessage(const String& message) {
    char* url = getPGMString(urlPushMessage);
    char* aj = getPGMString(applicationJson);
    char* ct = getPGMString(contentType);
    char* att = getPGMString(androidTickerText);
    char* actitle = getPGMString(androidContentTitle);
    char* actext = getPGMString(androidContentText);
    if (https.begin(*client, String(url))) {
        String data;
        data = R"({"message":")" + message + "\"}";
        https.addHeader(String(ct), String(aj));
        https.addHeader(String(att), F("You just got a push notification!"));
        https.addHeader(String(actitle), F("This is a notification title"));
        https.addHeader(String(actext), F("Push Notifications are cool"));

        int httpCode = https.POST(data);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.println(F("   PUSH уведомление отправлено"));
        } else {
            Serial.printf_P(PSTR("   sendMessage() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "   sendMessage() -> Невозможно подключиться\n");
    }
    delPtr(url);
    delPtr(ct);
    delPtr(att);
    delPtr(actitle);
    delPtr(actext);
    delPtr(aj);
}

void sendMessage(Sensor* device, bool state) {
    char dataMsg[100];
    String stateString = state ? "включение" : "выключение";
    char* p = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    sprintf(dataMsg, "%s: %s", device->getName().c_str(), String(p).c_str());
    delPtr(p);

    char* url = getPGMString(urlPushMessage);
    char* aj = getPGMString(applicationJson);
    char* ct = getPGMString(contentType);
    char* att = getPGMString(androidTickerText);
    char* actitle = getPGMString(androidContentTitle);
    char* actext = getPGMString(androidContentText);

    if (https.begin(*client, String(url))) {
        String data;
        data = R"({"message":")" + stateString + "\"}";
        https.addHeader(String(ct), String(aj));
        https.addHeader(String(att), F("You just got a push notification!"));
        https.addHeader(String(actitle), F("This is a notification title"));
        https.addHeader(String(actext), String(dataMsg));
        int httpCode = https.POST(data);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
            Serial.println(F("   PUSH уведомление отправлено"));
        } else {
            Serial.printf_P(PSTR("   sendMessage() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "   sendMessage() -> Невозможно подключиться\n");
    }
    delPtr(url);
    delPtr(ct);
    delPtr(att);
    delPtr(actitle);
    delPtr(actext);
    delPtr(aj);
    stateString.clear();
}

AlarmID_t findAlarmByDevice(Sensor* device, bool isOn) {
    AlarmID_t result = -1;
    for (auto scheduleItem : schedules) {
        auto deviceToFind = scheduleItem.getDevice();
        if (device == deviceToFind) {
            result = isOn ? scheduleItem.getOn() : scheduleItem.getOff();
            break;
        }
    }
    return result;
}

AlarmID_t findAlarmIDBySensor(Sensor* sensor) {
    AlarmID_t result = -1;
    for (auto scheduleItem : schedules) {
        auto sensorToFind = scheduleItem.getDevice();
        if (sensor == sensorToFind) {
            result = scheduleItem.getAlarm();
            break;
        }
    }
    return result;
}

void doserOnHandler(Sensor* device, bool flag) {
    auto sensor = static_cast<Doser*>(device);
    if (device->getEnabled()) {
        Serial.printf_P(PSTR("%s: включение\n"), sensor->getName().c_str());

        String message;
        message = "Включение дозатора " + String(sensor->getName().c_str());
        sendMessage(message);
        message.clear();
        uint16_t steps = sensor->getSteps();

        switch (sensor->getDoserType()) {
            case Doser::K:
                doserK->begin();
                doserK->setEnableActiveState(LOW);
                doserK->move(steps);
                doserK->setEnableActiveState(HIGH);
                break;
            case Doser::NP:
                doserNP->begin();
                doserNP->setEnableActiveState(LOW);
                doserNP->move(steps);
                doserNP->setEnableActiveState(HIGH);
                break;
            case Doser::Fe:
                doserFe->begin();
                doserFe->setEnableActiveState(LOW);
                doserFe->move(steps);
                doserFe->setEnableActiveState(HIGH);
                break;
            default:
                break;
        }

        Alarm.enable(findAlarmByDevice(device, true));
    } else {
        Serial.printf_P(PSTR("%s %s\n"), sensor->getName().c_str(), "нельзя изменять.");
        Alarm.disable(findAlarmByDevice(device, true));
    }
}

void sensorHandler(Sensor* sensor, bool state) {
    if (sensor->getEnabled()) {
        if (state) {
            Serial.printf_P(PSTR("  %s: включение, pin %d\n"), sensor->getName().c_str(), sensor->getPin());
        } else {
            Serial.printf_P(PSTR("  %s: выключение, pin %d\n"), sensor->getName().c_str(), sensor->getPin());
        }
        shiftRegister.setPin(countShiftRegister, sensor->getPin(), state ? HIGH : LOW);
        sendMessage(sensor, state);
        Alarm.enable(findAlarmIDBySensor(sensor));
        sensor->setStateNotify(state);
    } else {
        Serial.printf_P(PSTR("%s %s\n"), sensor->getName().c_str(), "нельзя изменять.");
        Alarm.disable(findAlarmIDBySensor(sensor));
    }
}

void parseJSONLights(const String& response) {
    DynamicJsonDocument doc(1300);
    DeserializationError err = deserializeJson(doc, response);
    if (err) {
        Serial.print(F(" Ошибка разбора: "));
        Serial.println(err.c_str());
        return;
    } else {
        JsonArray array = doc.as<JsonArray>();
        for (JsonObject obj : array) {
            boolean enabled = obj["enabled"];
            std::string name = obj["name"];
            std::string off = obj["off"];
            std::string on = obj["on"];
            uint8_t pin = obj["pin"];
            boolean state = obj["state"];
            std::string objectId = obj["objectId"];
            off = off.substr(0, 10);
            on = on.substr(0, 10);

