Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
            for (auto&& light : lights) {
                if (name == light.getName()) {
                    light.setState(state);
                    light.setEnabled(enabled);
                    light.setPin(pin);
                    light.setObjectID(objectId);
                    light.setOn(static_cast<time_t>(std::stoul(on)));
                    light.setOff(static_cast<time_t>(std::stoul(off)));
                }
            }
        }
        doc.shrinkToFit();
        doc.clear();
    }
}
void parseJSONDosers(const String& response) {
    DynamicJsonDocument document(1300);
    DeserializationError error = deserializeJson(document, response);
    if (error) {
        Serial.printf_P(PSTR("%s: %s"), "Невозможно выполнить парсинг", error.c_str());
        return;
    } else {
        JsonArray array = document.as<JsonArray>();
        for (JsonObject object : array) {
            uint8_t m0 = object["m0"];
            uint8_t m1 = object["m1"];
            uint8_t m2 = object["m2"];
            uint8_t index = object["index"];
            uint8_t dir = object["dir"];
            uint16_t steps = object["steps"];
            bool enabled = object["enabled"];
            uint8_t sleep = object["sleep"];
            uint16_t volume = object["volume"];
            uint8_t enable = object["enable"];
            std::string name = object["name"];
            uint8_t step = object["step"];
            bool state = object["state"];
            std::string objectId = object["objectId"];
            std::string on = object["on"];

            on = on.substr(0, 10);
            for (auto&& doserItem : dosers) {
                if (name == doserItem.getName()) {
                    doserItem.setState(state);
                    doserItem.setEnabled(enabled);
                    doserItem.setObjectID(objectId);
                    doserItem.setOn(static_cast<time_t>(std::stoul(on)));

                    doserItem.setMode0Pin(m0);
                    doserItem.setMode1Pin(m1);
                    doserItem.setMode2Pin(m2);
                    doserItem.setIndex(index);
                    doserItem.setDirPin(dir);
                    doserItem.setSteps(steps);
                    doserItem.setSleepPin(sleep);
                    doserItem.setVolume(volume);
                    doserItem.setEnablePin(enable);
                    doserItem.setStepPin(step);
                    /*
                    #ifdef ARDUINO_ARCH_ESP32
                                        emptyDoser = std_esp32::make_unique<GBasic>(dosersArray[ind].steps, dosersArray[ind].dirPin,
                                                                                    dosersArray[ind].stepPin,
                    dosersArray[ind].enablePin, dosersArray[ind].mode0_pin, dosersArray[ind].mode1_pin, dosersArray[ind].mode2_pin,
                    shiftRegister, dosersArray[ind].index); #else emptyDoser = std::make_unique<GBasic>(dosersArray[ind].steps,
                    dosersArray[ind].dirPin, dosersArray[ind].stepPin, dosersArray[ind].enablePin, dosersArray[ind].mode0_pin,
                    dosersArray[ind].mode1_pin, dosersArray[ind].mode2_pin, shiftRegister, dosersArray[ind].index); #endif switch
                    (doserItem.type) { case K: doserK = std::move(emptyDoser); break; case NP: doserNP = std::move(emptyDoser);
                                                break;
                                            case Fe:
                                                doserFe = std::move(emptyDoser);
                                                break;
                                            default:
                                                Serial.printf_P(PSTR("%s %s"), "Неизвестный тип дозатора",
                    ToString(doserItem.type)); break;
                                        }
                                        dosersArray[ind].alarm =
                                            Alarm.alarmRepeat(dosersArray[ind].hour, dosersArray[ind].minute, 0, doserHandler,
                    dosersArray[ind]);
                                        // TODO Селать проверку на было ли уже событие в текущем дне
                                      */
                }
            }
        }
        document.shrinkToFit();
        document.clear();
    }
}

void parseJSONCompressor(const String& response) {
    DynamicJsonDocument doc(250);
    DeserializationError err = deserializeJson(doc, response);
    if (err) {
        Serial.print(F(" Ошибка разбора: "));
        Serial.println(err.c_str());
        return;
    } else {
        JsonArray array = doc.as<JsonArray>();
        for (JsonObject obj : array) {
            boolean enabled = obj["enabled"];
            std::string off = obj["off"];
            std::string on = obj["on"];
            uint8_t pin = obj["pin"];
            boolean state = obj["state"];
            std::string objectId = obj["objectId"];
            off = off.substr(0, 10);
            on = on.substr(0, 10);

            compressor->setState(state);
            compressor->setEnabled(enabled);
            compressor->setPin(pin);
            compressor->setObjectID(objectId);
            compressor->setOn(static_cast<time_t>(std::stoul(on)));
            compressor->setOff(static_cast<time_t>(std::stoul(off)));
        }
        doc.shrinkToFit();
        doc.clear();
    }
}

void parseJSONFlow(const String& response) {
    DynamicJsonDocument doc(250);
    DeserializationError err = deserializeJson(doc, response);
    if (err) {
        Serial.print(F(" Ошибка разбора: "));
        Serial.println(err.c_str());
        return;
    } else {
        JsonArray array = doc.as<JsonArray>();
        for (JsonObject obj : array) {
            boolean enabled = obj["enabled"];
            std::string off = obj["off"];
            std::string on = obj["on"];
            uint8_t pin = obj["pin"];
            boolean state = obj["state"];
            std::string objectId = obj["objectId"];
            off = off.substr(0, 10);
            on = on.substr(0, 10);

            flow->setState(state);
            flow->setEnabled(enabled);
            flow->setPin(pin);
            flow->setObjectID(objectId);
            flow->setOn(static_cast<time_t>(std::stoul(on)));
            flow->setOff(static_cast<time_t>(std::stoul(off)));
        }
        doc.shrinkToFit();
        doc.clear();
    }
}

void parseJSONCO2(const String& response) {
    DynamicJsonDocument doc(250);
    DeserializationError err = deserializeJson(doc, response);
    if (err) {
        Serial.print(F(" Ошибка разбора: "));
        Serial.println(err.c_str());
        return;
    } else {
        JsonArray array = doc.as<JsonArray>();
        for (JsonObject obj : array) {
            boolean enabled = obj["enabled"];
            std::string off = obj["off"];
            std::string on = obj["on"];
            uint8_t pin = obj["pin"];
            boolean state = obj["state"];
            std::string objectId = obj["objectId"];
            off = off.substr(0, 10);
            on = on.substr(0, 10);

