Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
                schedules.at(i) = schedule;
                (sensor->shouldRun(clockRTC.getDateTime().hour, clockRTC.getDateTime().minute)) ? sensorHandler(sensor, true)
                                                                                                : sensorHandler(sensor, false);
            }
            break;
        case Sensor::light:
            for (size_t i = 0; i < DEVICE_COUNT; i++) {
                if (!schedules.at(i).getDevice()->isLight()) {
                    continue;
                }
                auto schedule = schedules.at(i);
                auto sensor = schedule.getDevice();
                auto alarm = Alarm.alarmRepeat(sensor->getHourOn(), sensor->getMinuteOn(), sensor->getHourOff(),
                                               sensor->getMinuteOff(), sensorHandler, sensor);
                schedule.setAlarm(alarm);

                schedules.at(i) = schedule;
                (sensor->shouldRun(clockRTC.getDateTime().hour, clockRTC.getDateTime().minute)) ? sensorHandler(sensor, true)
                                                                                                : sensorHandler(sensor, false);
            }
            break;
        case Sensor::pump:
            for (size_t i = 0; i < DEVICE_COUNT; i++) {
                if (!schedules.at(i).getDevice()->isPump()) {
                    continue;
                }
                auto schedule = schedules.at(i);
                auto sensor = schedule.getDevice();
                auto alarm = Alarm.alarmRepeat(sensor->getHourOn(), sensor->getMinuteOn(), sensor->getHourOff(),
                                               sensor->getMinuteOff(), sensorHandler, sensor);
                schedule.setAlarm(alarm);

                schedules.at(i) = schedule;
                (sensor->shouldRun(clockRTC.getDateTime().hour, clockRTC.getDateTime().minute)) ? sensorHandler(sensor, true)
                                                                                                : sensorHandler(sensor, false);
            }
            break;
        case Sensor::doser:
            std::unique_ptr<GBasic> emptyDoser{};
            for (size_t i = 0; i < DEVICE_COUNT; i++) {
                if (!schedules.at(i).getDevice()->isDoser()) {
                    continue;
                }
                auto schedule = schedules.at(i);
                auto sensor = static_cast<Doser*>(schedule.getDevice());

                emptyDoser = std::make_unique<GBasic>(sensor->getSteps(), sensor->getDirPin(), sensor->getStepPin(),
                                                      sensor->getEnablePin(), sensor->getMode0Pin(), sensor->getMode1Pin(),
                                                      sensor->getMode2Pin(), shiftRegister, sensor->getIndex());
                auto doserType = sensor->getDoserType();
                if (doserType == Doser::K) {
                    doserK = std::move(emptyDoser);
                } else if (doserType == Doser::NP) {
                    doserNP = std::move(emptyDoser);
                } else if (doserType == Doser::Fe) {
                    doserFe = std::move(emptyDoser);
                } else {
                    Serial.printf_P(PSTR("%s"), "Неизвестный тип дозатора");
                }
                auto alarm = Alarm.alarmRepeat(sensor->getHourOn(), sensor->getMinuteOn(), 0, 0, doserOnHandler, sensor);

                // auto alarmOn = Alarm.alarmRepeat(sensor->getHourOn(), sensor->getMinuteOn(), 0, doserOnHandler, sensor);

                schedule.setOn(alarm);
                schedules.at(i) = schedule;
                // TODO Селать проверку на было ли уже событие в текущем дне
                // (sensor->shouldRun(clockRTC.getDateTime().hour, clockRTC.getDateTime().minute)) ? deviceOnHandler(sensor)
                //                                                                                 : deviceOffHandler(sensor);
            }
            break;
    }
}

void getParamLights() {
    char* url = getPGMString(urlLights);
    Serial.printf_P(PSTR("\n %s\n"), "Прожекторы...");
    if (https.begin(*client, String(url))) {
        int httpCode = https.GET();
        if (httpCode > 0) {
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
                responseString = https.getString();
            }
        } else {
            Serial.printf_P(PSTR(" %s %s\n"), "Ошибка:", HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR(" %s\n"), "Невозможно подключиться\n");
    }
    delPtr(url);
    if (responseString.isEmpty()) {
        Serial.printf_P(PSTR(" %s\n"), "Ответ пустой");
    } else {
        parseJSONLights(responseString);
        responseString.clear();
        attachAlarm(Sensor::light);
    }
}

void getParamDosers() {
    char* url = getPGMString(urlDosers);
    Serial.printf_P(PSTR("\n %s\n"), "Дозаторы...");
    if (https.begin(*client, String(url))) {
        int httpCode = https.GET();
        if (httpCode > 0) {
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
                responseString = https.getString();
            }
        } else {
            Serial.printf_P(PSTR(" %s %s\n"), "Ошибка:", HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR(" %s\n"), "Невозможно подключиться\n");
    }
    delPtr(url);
    if (responseString.isEmpty()) {
        Serial.printf_P(PSTR(" %s\n"), "Ответ пустой");
    } else {
        parseJSONDosers(responseString);
        responseString.clear();
        attachAlarm(Sensor::doser);
    }
}

void getParamCompressor() {
    char* url = getPGMString(urlCompressor);
    Serial.printf_P(PSTR("\n %s\n"), "Компрессор...");
    if (https.begin(*client, String(url))) {
        int httpCode = https.GET();
        if (httpCode > 0) {
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
                responseString = https.getString();
            }
        } else {
            Serial.printf_P(PSTR(" %s %s\n"), "Ошибка:", HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR(" %s\n"), "Невозможно подключиться\n");
    }
    delPtr(url);
    if (responseString.isEmpty()) {
        Serial.printf_P(PSTR(" %s\n"), "Ответ пустой");
    } else {
        parseJSONCompressor(responseString);
        responseString.clear();
        attachAlarm(Sensor::compressor);
    }
}

void getParamFlow() {
    char* url = getPGMString(urlFlow);
    Serial.printf_P(PSTR("\n %s\n"), "Помпа течения...");
    if (https.begin(*client, String(url))) {
        int httpCode = https.GET();
        if (httpCode > 0) {
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
                responseString = https.getString();
            }
        } else {
            Serial.printf_P(PSTR(" %s %s\n"), "Ошибка:", HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR(" %s\n"), "Невозможно подключиться\n");
    }
    delPtr(url);
    if (responseString.isEmpty()) {
        Serial.printf_P(PSTR(" %s\n"), "Ответ пустой");
    } else {
        parseJSONFlow(responseString);
        responseString.clear();
        attachAlarm(Sensor::flow);
    }
}

void getParamCO2() {
    char* url = getPGMString(urlCO2);
    Serial.printf_P(PSTR("\n %s\n"), "CO2...");
    if (https.begin(*client, String(url))) {
        int httpCode = https.GET();
        if (httpCode > 0) {
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
                responseString = https.getString();
            }
        } else {
            Serial.printf_P(PSTR(" %s %s\n"), "Ошибка:", HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR(" %s\n"), "Невозможно подключиться\n");
    }
    delPtr(url);
    if (responseString.isEmpty()) {
        Serial.printf_P(PSTR(" %s\n"), "Ответ пустой");
    } else {
        parseJSONCO2(responseString);
        responseString.clear();
        attachAlarm(Sensor::co2);
    }
}

void getParamHeater() {
    char* url = getPGMString(urlHeater);
    Serial.printf_P(PSTR("\n %s\n"), "Нагреватель...");
    if (https.begin(*client, String(url))) {
        int httpCode = https.GET();
        if (httpCode > 0) {
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
                responseString = https.getString();
            }
        } else {
            Serial.printf_P(PSTR(" %s %s\n"), "Ошибка:", HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR(" %s\n"), "Невозможно подключиться\n");
    }
    delPtr(url);
    if (responseString.isEmpty()) {
        Serial.printf_P(PSTR(" %s\n"), "Ответ пустой");
    } else {
        parseJSONHeater(responseString);
        responseString.clear();
        attachAlarm(Sensor::heater);
    }
}

void getParamPump() {
    char* url = getPGMString(urlPump);
    Serial.printf_P(PSTR("\n %s\n"), "Помпа...");
    if (https.begin(*client, String(url))) {
        int httpCode = https.GET();
        if (httpCode > 0) {
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
                responseString = https.getString();
            }
        } else {
            Serial.printf_P(PSTR(" %s %s\n"), "Ошибка:", HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR(" %s\n"), "Невозможно подключиться\n");
    }
    delPtr(url);
    if (responseString.isEmpty()) {
        Serial.printf_P(PSTR(" %s\n"), "Ответ пустой");
    } else {
        parseJSONPump(responseString);
        responseString.clear();
        attachAlarm(Sensor::pump);
    }
}

